package com.epam.kaliada.strings.strinbuilder;
//Дан текст (строка). Найдите наибольшее количество подряд идущих пробелов в нем.
public class Task1 {
    public static void qw(){
        System.out.println("222");
    }
}
