package com.epam.kaliada.javaalgorithmization.arraysofarrays;
//Дана матрица. Вывести k-ю строку и p-й столбец матрицы.
public class Task3 {
    public static void printStringKColumnPInMatrix(int[][] a, int k, int p){
        System.out.println(a[k][p]);
    }
}
