package com.epam.kaliada.javabasics.cycles;
//Вывести на экран соответствий между символами и их численными обозначениями в памяти компьютера
public class Task5 {
    public static void writeSymbolInUnicod(char a){
        System.out.println((short) a);
    }
}
